# Install MySQL connector module
pip install mysql-connector-python

# a package that provides access to MySQL Driver for different programming languages.

In [3]:
# importing required libraries
import mysql.connector

In [4]:
database = mysql.connector.connect(
  host ="localhost",
  user ="root",
  passwd ="24122004"
)
 
print(database)
print("Connect to mySQL server sucessfully")

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000029F23AC1D50>
Connect to mySQL server sucessfully

In [5]:
# preparing a cursor object
cursorObject = database.cursor()

 #Use the cursor() method of a MySQLConnection object to create a cursor object to perform various SQL operations.

In [7]:
# Create databse
cursorObject.execute("CREATE DATABASE STUDENT_INFORMATION")

In [8]:
# Connect to database: 

if database .is_connected():
        db_Info = database.get_server_info()
        print("Connected to MySQL Server version ", db_Info)

        #Use the cursor() method of a MySQLConnection object to create a cursor object to perform various SQL operations.
        # The execute() methods run the SQL query and return the result.
        cursorObject.execute("USE STUDENT_INFORMATION;")

        # Extract results: 
        record = cursorObject.fetchone()     
        print("Connected to database", record)

Connected to MySQL Server version  8.1.0
Connected to database None

In [25]:
# Drop database
try: 
    cursorObject.execute("DROP DATABASE IF EXISTS STUDENT_INFORMATION")
    print("Drop database")
except: 
    database.rollback()    # Roll back database

In [9]:
# Create table Classes: 
cursorObject.execute("USE STUDENT_INFORMATION;")
courses = """CREATE TABLE CLASSES( 
    COURSE_TITLE VARCHAR(225) NOT NULL,
    COURSE_ID VARCHAR(50) NOT NULL,
    PRIMARY KEY(COURSE_ID),
    SCHEDULE varchar(225),
    ROOM int,
    LOCATION varchar(225))"""

# Notify: 


Result = cursorObject.execute(courses)
print("Table CLASSES created successfully ")

Table CLASSES created successfully

In [10]:
# Create table international student: 

# add foreign key class ID references course ID in table classes

cursorObject.execute("USE STUDENT_INFORMATION;")
studentRecord = """CREATE TABLE INTERNATIONAL_STUDENT( 
    NAME VARCHAR(20) NOT NULL,
    STUDENT_ID INT NOT NULL AUTO_INCREMENT, 
    PRIMARY KEY(STUDENT_ID),
    ADDRESS VARCHAR(50),
    GENDER VARCHAR(50),
    AGE INT, 
    CLASS_ID VARCHAR(50),
    INDEX (CLASS_ID),
    FOREIGN KEY (CLASS_ID) REFERENCES CLASSES(COURSE_ID))"""

# Notify: 

cursor = database.cursor()
Result = cursor.execute(studentRecord)
print("Student Record created successfully ")

Student Record created successfully

In [140]:
cursorObject.execute("drop table international_student;")

In [93]:
cursorObject.execute("drop table classes;")

In [11]:
# Insert data into table Classes: 
cursorObject. execute("INSERT INTO CLASSES (COURSE_TITLE, COURSE_ID, SCHEDULE, ROOM, LOCATION) VALUES ('Information_security','INS306203','Wednesday',601,'Xuan_Thuy')")
cursorObject. execute("INSERT INTO CLASSES (COURSE_TITLE, COURSE_ID, SCHEDULE, ROOM, LOCATION) VALUES ('Economic_Statistics','INS200401','Monday',402,'TVB')")
cursorObject. execute("INSERT INTO CLASSES (COURSE_TITLE, COURSE_ID, SCHEDULE, ROOM, LOCATION) VALUES ('Advanced_Mathematics','MAT109207','Tuesday',601,'Hacinco')")
cursorObject. execute("INSERT INTO CLASSES (COURSE_TITLE, COURSE_ID, SCHEDULE, ROOM, LOCATION) VALUES ('Microeconomics','INE105005','Wednesday',601,'Xuan_Thuy')")
cursorObject. execute("INSERT INTO CLASSES (COURSE_TITLE, COURSE_ID, SCHEDULE, ROOM, LOCATION) VALUES ('Fundamentals_of_Finance','INS201505','Tuesday',407,'TVB')")
cursorObject. execute("INSERT INTO CLASSES (COURSE_TITLE, COURSE_ID, SCHEDULE, ROOM, LOCATION) VALUES ('Introduction_to_Data Science','INS325401','Thursday',604,'TVB')")
cursorObject. execute("INSERT INTO CLASSES (COURSE_TITLE, COURSE_ID, SCHEDULE, ROOM, LOCATION) VALUES ('Econometrics','INS304902','Thursday',506,'Hacinco')")
cursorObject. execute("INSERT INTO CLASSES (COURSE_TITLE, COURSE_ID, SCHEDULE, ROOM, LOCATION) VALUES ('Databases','INS208004','Wednesday',401,'TVB')")

In [11]:
cursorObject.execute("Insert into Classes(COURSE_TITLE, COURSE_ID,SCHEDULE, ROOM, LOCATION ) VALUES ('Tin_hoc', 'INS304','Wednesday', 407, 'TVB' )")

In [12]:
# Insert data into table International_student: 
cursorObject. execute("INSERT INTO INTERNATIONAL_STUDENT (NAME, ADDRESS, GENDER, AGE, CLASS_ID) VALUES ('Phuong','Hanoi','Female', 18, 'INS306203')")
cursorObject. execute("INSERT INTO INTERNATIONAL_STUDENT(NAME, ADDRESS, GENDER, AGE, CLASS_ID) VALUES ('An','Thai_Binh','Male', 19, 'INS200401')")
cursorObject.execute("INSERT INTO INTERNATIONAL_STUDENT (NAME, ADDRESS, GENDER, AGE, CLASS_ID) VALUES ('PA','Hoa_Binh','Female', 19, 'MAT109207')")
cursorObject.execute("INSERT INTO INTERNATIONAL_STUDENT (NAME, ADDRESS, GENDER, AGE, CLASS_ID) VALUES ('Ninh_Hai','Hai_Duong','Female', 19,'INE105005')")
cursorObject.execute("INSERT INTO INTERNATIONAL_STUDENT (NAME, ADDRESS, GENDER, AGE, CLASS_ID) VALUES ('Duc_Nam','Tuyen_Quang','Male', 20,'INS201505')")
cursorObject. execute("INSERT INTO INTERNATIONAL_STUDENT (NAME, ADDRESS, GENDER, AGE, CLASS_ID) VALUES ('Hoa_Ngoc','Hung_Yen','Female', 19, 'INS325401')")
cursorObject. execute("INSERT INTO INTERNATIONAL_STUDENT (NAME, ADDRESS, GENDER, AGE, CLASS_ID) VALUES ('Thanh_Phuong','Nam_Dinh','Male', 20,'INS304902')")
cursorObject. execute("INSERT INTO INTERNATIONAL_STUDENT (NAME, ADDRESS, GENDER, AGE, CLASS_ID) VALUES ('Trung','Ha_Noi','Male', 22,'INS208004')")

print("Insert completed")

Insert completed

In [13]:
# Print data from table International student: 
cursorObject.execute("""SELECT * FROM INTERNATIONAL_STUDENT""")
student_data= cursorObject.fetchall()
for i in student_data: 
    print(i)

('Phuong', 1, 'Hanoi', 'Female', 18, 'INS306203')
('An', 2, 'Thai_Binh', 'Male', 19, 'INS200401')
('PA', 3, 'Hoa_Binh', 'Female', 19, 'MAT109207')
('Ninh_Hai', 4, 'Hai_Duong', 'Female', 19, 'INE105005')
('Duc_Nam', 5, 'Tuyen_Quang', 'Male', 20, 'INS201505')
('Hoa_Ngoc', 6, 'Hung_Yen', 'Female', 19, 'INS325401')
('Thanh_Phuong', 7, 'Nam_Dinh', 'Male', 20, 'INS304902')
('Trung', 8, 'Ha_Noi', 'Male', 22, 'INS208004')

In [14]:
# Print the table Classes: 
cursorObject.execute("""SELECT * FROM CLASSES""")
student_data= cursorObject.fetchall()
for i in student_data: 
    print(i)

('Microeconomics', 'INE105005', 'Wednesday', 601, 'Xuan_Thuy')
('Economic_Statistics', 'INS200401', 'Monday', 402, 'TVB')
('Fundamentals_of_Finance', 'INS201505', 'Tuesday', 407, 'TVB')
('Databases', 'INS208004', 'Wednesday', 401, 'TVB')
('Econometrics', 'INS304902', 'Thursday', 506, 'Hacinco')
('Information_security', 'INS306203', 'Wednesday', 601, 'Xuan_Thuy')
('Introduction_to_Data Science', 'INS325401', 'Thursday', 604, 'TVB')
('Advanced_Mathematics', 'MAT109207', 'Tuesday', 601, 'Hacinco')

In [15]:
# Update data: 
student_update = "UPDATE INTERNATIONAL_STUDENT SET AGE = 21 WHERE NAME = 'Duc_Nam'"
cursorObject.execute(student_update)
database.commit()
print("Updated sucessfully")

Updated sucessfully

In [16]:
# DELETE DATA FROM TABLE: 

query = "DELETE FROM INTERNATIONAL_STUDENT WHERE STUDENT_ID = 3"
cursorObject.execute(query)
database.commit()
print("Record deleted")

Record deleted

In [17]:
# Print data again from table International student: 
cursorObject = database.cursor()
cursorObject.execute("""SELECT * FROM INTERNATIONAL_STUDENT""")
student_data= cursorObject.fetchall()
for i in student_data: 
    print(i)

('Phuong', 1, 'Hanoi', 'Female', 18, 'INS306203')
('An', 2, 'Thai_Binh', 'Male', 19, 'INS200401')
('Ninh_Hai', 4, 'Hai_Duong', 'Female', 19, 'INE105005')
('Duc_Nam', 5, 'Tuyen_Quang', 'Male', 21, 'INS201505')
('Hoa_Ngoc', 6, 'Hung_Yen', 'Female', 19, 'INS325401')
('Thanh_Phuong', 7, 'Nam_Dinh', 'Male', 20, 'INS304902')
('Trung', 8, 'Ha_Noi', 'Male', 22, 'INS208004')

In [18]:
# Print data again from table International student where student having age>20: 
cursorObject = database.cursor()
cursorObject.execute("""SELECT * FROM INTERNATIONAL_STUDENT where age > 19""")
student_data= cursorObject.fetchall()
for i in student_data: 
    print(i)

('Duc_Nam', 5, 'Tuyen_Quang', 'Male', 21, 'INS201505')
('Thanh_Phuong', 7, 'Nam_Dinh', 'Male', 20, 'INS304902')
('Trung', 8, 'Ha_Noi', 'Male', 22, 'INS208004')

In [19]:
# Print data again from table International student where student having age between 18 and 20: 
cursorObject = database.cursor()
cursorObject.execute("""SELECT * FROM INTERNATIONAL_STUDENT where age between 18 and 20""")
student_data= cursorObject.fetchall()
for i in student_data: 
    print(i)

('Phuong', 1, 'Hanoi', 'Female', 18, 'INS306203')
('An', 2, 'Thai_Binh', 'Male', 19, 'INS200401')
('Ninh_Hai', 4, 'Hai_Duong', 'Female', 19, 'INE105005')
('Hoa_Ngoc', 6, 'Hung_Yen', 'Female', 19, 'INS325401')
('Thanh_Phuong', 7, 'Nam_Dinh', 'Male', 20, 'INS304902')

In [21]:
# JOIN 2 TABLES TOGETHER: 

# Check the database connection: 
database = mysql.connector.connect(
    host ="localhost",
    user ="root",
    passwd ="24122004",
    database="STUDENT_INFORMATION"
)


cursorObject = database.cursor()

with cursorObject:
    cursorObject.execute("""SELECT * FROM INTERNATIONAL_STUDENT 
                         INNER JOIN CLASSES ON INTERNATIONAL_STUDENT.CLASS_ID = CLASSES.COURSE_ID
                         ORDER BY NAME""")
    
    # Fetch and print the results of the query
    result = cursorObject.fetchall()
    for row in result:
        print(row)

# Close the cursor and database connection manually
cursorObject.close()
database.close()

('An', 2, 'Thai_Binh', 'Male', 19, 'INS200401', 'Economic_Statistics', 'INS200401', 'Monday', 402, 'TVB')
('Duc_Nam', 5, 'Tuyen_Quang', 'Male', 21, 'INS201505', 'Fundamentals_of_Finance', 'INS201505', 'Tuesday', 407, 'TVB')
('Hoa_Ngoc', 6, 'Hung_Yen', 'Female', 19, 'INS325401', 'Introduction_to_Data Science', 'INS325401', 'Thursday', 604, 'TVB')
('Ninh_Hai', 4, 'Hai_Duong', 'Female', 19, 'INE105005', 'Microeconomics', 'INE105005', 'Wednesday', 601, 'Xuan_Thuy')
('Phuong', 1, 'Hanoi', 'Female', 18, 'INS306203', 'Information_security', 'INS306203', 'Wednesday', 601, 'Xuan_Thuy')
('Thanh_Phuong', 7, 'Nam_Dinh', 'Male', 20, 'INS304902', 'Econometrics', 'INS304902', 'Thursday', 506, 'Hacinco')
('Trung', 8, 'Ha_Noi', 'Male', 22, 'INS208004', 'Databases', 'INS208004', 'Wednesday', 401, 'TVB')